###################################################################

# Created by write_sdc on Wed Apr 29 09:34:52 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_operating_conditions slow -library slow
set_max_area 0
set_max_fanout 20 [current_design]
set_load -pin_load 0.001212 [get_ports compute_finish]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea0[3]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea0[2]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea0[1]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea0[0]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[15]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[14]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[13]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[12]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[11]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[10]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[9]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[8]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[7]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[6]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[5]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[4]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[3]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[2]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[1]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr0[0]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[31]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[30]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[29]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[28]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[27]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[26]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[25]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[24]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[23]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[22]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[21]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[20]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[19]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[18]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[17]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[16]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[15]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[14]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[13]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[12]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[11]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[10]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[9]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[8]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[7]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[6]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[5]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[4]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[3]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[2]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[1]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata0[0]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea1[3]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea1[2]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea1[1]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wea1[0]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[15]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[14]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[13]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[12]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[11]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[10]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[9]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[8]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[7]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[6]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[5]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[4]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[3]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[2]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[1]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_addr1[0]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[31]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[30]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[29]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[28]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[27]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[26]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[25]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[24]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[23]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[22]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[21]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[20]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[19]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[18]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[17]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[16]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[15]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[14]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[13]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[12]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[11]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[10]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[9]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[8]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[7]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[6]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[5]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[4]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[3]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[2]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[1]}]
set_load -pin_load 0.001212 [get_ports {sram_weight_wdata1[0]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea0[3]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea0[2]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea0[1]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea0[0]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[15]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[14]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[13]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[12]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[11]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[10]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[9]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[8]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[7]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[6]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[5]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[4]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[3]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[2]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[1]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr0[0]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[31]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[30]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[29]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[28]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[27]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[26]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[25]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[24]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[23]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[22]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[21]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[20]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[19]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[18]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[17]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[16]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[15]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[14]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[13]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[12]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[11]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[10]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[9]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[8]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[7]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[6]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[5]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[4]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[3]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[2]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[1]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata0[0]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea1[3]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea1[2]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea1[1]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wea1[0]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[15]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[14]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[13]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[12]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[11]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[10]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[9]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[8]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[7]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[6]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[5]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[4]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[3]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[2]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[1]}]
set_load -pin_load 0.001212 [get_ports {sram_act_addr1[0]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[31]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[30]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[29]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[28]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[27]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[26]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[25]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[24]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[23]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[22]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[21]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[20]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[19]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[18]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[17]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[16]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[15]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[14]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[13]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[12]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[11]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[10]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[9]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[8]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[7]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[6]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[5]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[4]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[3]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[2]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[1]}]
set_load -pin_load 0.001212 [get_ports {sram_act_wdata1[0]}]
create_clock [get_ports clk]  -period 13.9  -waveform {0 6.95}
set_input_delay -clock clk  6.95  [get_ports rst_n]
set_input_delay -clock clk  6.95  [get_ports compute_start]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[31]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[30]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[29]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[28]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[27]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[26]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[25]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[24]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[23]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[22]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[21]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[20]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[19]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[18]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[17]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[16]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[15]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[14]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[13]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[12]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[11]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[10]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[9]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[8]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[7]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[6]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[5]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[4]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[3]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[2]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[1]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV1[0]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[31]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[30]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[29]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[28]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[27]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[26]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[25]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[24]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[23]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[22]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[21]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[20]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[19]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[18]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[17]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[16]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[15]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[14]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[13]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[12]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[11]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[10]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[9]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[8]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[7]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[6]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[5]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[4]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[3]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[2]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[1]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV2[0]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[31]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[30]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[29]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[28]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[27]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[26]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[25]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[24]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[23]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[22]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[21]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[20]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[19]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[18]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[17]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[16]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[15]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[14]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[13]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[12]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[11]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[10]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[9]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[8]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[7]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[6]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[5]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[4]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[3]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[2]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[1]}]
set_input_delay -clock clk  6.95  [get_ports {scale_CONV3[0]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[31]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[30]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[29]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[28]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[27]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[26]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[25]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[24]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[23]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[22]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[21]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[20]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[19]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[18]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[17]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[16]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[15]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[14]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[13]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[12]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[11]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[10]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[9]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[8]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[7]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[6]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[5]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[4]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[3]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[2]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[1]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC1[0]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[31]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[30]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[29]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[28]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[27]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[26]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[25]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[24]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[23]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[22]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[21]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[20]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[19]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[18]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[17]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[16]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[15]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[14]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[13]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[12]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[11]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[10]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[9]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[8]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[7]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[6]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[5]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[4]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[3]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[2]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[1]}]
set_input_delay -clock clk  6.95  [get_ports {scale_FC2[0]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[31]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[30]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[29]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[28]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[27]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[26]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[25]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[24]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[23]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[22]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[21]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[20]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[19]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[18]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[17]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[16]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[15]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[14]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[13]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[12]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[11]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[10]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[9]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[8]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[7]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[6]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[5]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[4]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[3]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[2]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[1]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata0[0]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[31]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[30]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[29]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[28]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[27]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[26]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[25]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[24]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[23]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[22]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[21]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[20]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[19]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[18]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[17]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[16]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[15]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[14]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[13]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[12]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[11]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[10]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[9]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[8]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[7]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[6]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[5]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[4]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[3]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[2]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[1]}]
set_input_delay -clock clk  6.95  [get_ports {sram_weight_rdata1[0]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[31]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[30]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[29]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[28]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[27]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[26]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[25]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[24]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[23]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[22]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[21]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[20]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[19]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[18]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[17]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[16]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[15]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[14]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[13]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[12]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[11]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[10]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[9]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[8]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[7]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[6]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[5]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[4]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[3]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[2]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[1]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata0[0]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[31]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[30]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[29]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[28]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[27]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[26]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[25]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[24]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[23]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[22]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[21]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[20]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[19]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[18]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[17]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[16]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[15]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[14]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[13]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[12]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[11]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[10]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[9]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[8]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[7]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[6]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[5]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[4]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[3]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[2]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[1]}]
set_input_delay -clock clk  6.95  [get_ports {sram_act_rdata1[0]}]
set_output_delay -clock clk  6.95  [get_ports compute_finish]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea0[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea0[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea0[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea0[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr0[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[31]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[30]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[29]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[28]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[27]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[26]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[25]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[24]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[23]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[22]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[21]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[20]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[19]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[18]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[17]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[16]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata0[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea1[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea1[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea1[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wea1[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_addr1[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[31]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[30]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[29]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[28]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[27]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[26]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[25]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[24]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[23]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[22]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[21]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[20]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[19]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[18]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[17]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[16]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_weight_wdata1[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea0[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea0[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea0[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea0[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr0[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[31]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[30]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[29]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[28]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[27]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[26]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[25]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[24]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[23]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[22]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[21]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[20]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[19]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[18]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[17]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[16]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata0[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea1[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea1[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea1[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wea1[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_addr1[0]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[31]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[30]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[29]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[28]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[27]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[26]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[25]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[24]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[23]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[22]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[21]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[20]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[19]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[18]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[17]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[16]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[15]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[14]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[13]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[12]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[11]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[10]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[9]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[8]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[7]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[6]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[5]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[4]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[3]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[2]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[1]}]
set_output_delay -clock clk  6.95  [get_ports {sram_act_wdata1[0]}]
set_drive 7.63567  [get_ports rst_n]
set_drive 7.63567  [get_ports compute_start]
set_drive 7.63567  [get_ports {scale_CONV1[31]}]
set_drive 7.63567  [get_ports {scale_CONV1[30]}]
set_drive 7.63567  [get_ports {scale_CONV1[29]}]
set_drive 7.63567  [get_ports {scale_CONV1[28]}]
set_drive 7.63567  [get_ports {scale_CONV1[27]}]
set_drive 7.63567  [get_ports {scale_CONV1[26]}]
set_drive 7.63567  [get_ports {scale_CONV1[25]}]
set_drive 7.63567  [get_ports {scale_CONV1[24]}]
set_drive 7.63567  [get_ports {scale_CONV1[23]}]
set_drive 7.63567  [get_ports {scale_CONV1[22]}]
set_drive 7.63567  [get_ports {scale_CONV1[21]}]
set_drive 7.63567  [get_ports {scale_CONV1[20]}]
set_drive 7.63567  [get_ports {scale_CONV1[19]}]
set_drive 7.63567  [get_ports {scale_CONV1[18]}]
set_drive 7.63567  [get_ports {scale_CONV1[17]}]
set_drive 7.63567  [get_ports {scale_CONV1[16]}]
set_drive 7.63567  [get_ports {scale_CONV1[15]}]
set_drive 7.63567  [get_ports {scale_CONV1[14]}]
set_drive 7.63567  [get_ports {scale_CONV1[13]}]
set_drive 7.63567  [get_ports {scale_CONV1[12]}]
set_drive 7.63567  [get_ports {scale_CONV1[11]}]
set_drive 7.63567  [get_ports {scale_CONV1[10]}]
set_drive 7.63567  [get_ports {scale_CONV1[9]}]
set_drive 7.63567  [get_ports {scale_CONV1[8]}]
set_drive 7.63567  [get_ports {scale_CONV1[7]}]
set_drive 7.63567  [get_ports {scale_CONV1[6]}]
set_drive 7.63567  [get_ports {scale_CONV1[5]}]
set_drive 7.63567  [get_ports {scale_CONV1[4]}]
set_drive 7.63567  [get_ports {scale_CONV1[3]}]
set_drive 7.63567  [get_ports {scale_CONV1[2]}]
set_drive 7.63567  [get_ports {scale_CONV1[1]}]
set_drive 7.63567  [get_ports {scale_CONV1[0]}]
set_drive 7.63567  [get_ports {scale_CONV2[31]}]
set_drive 7.63567  [get_ports {scale_CONV2[30]}]
set_drive 7.63567  [get_ports {scale_CONV2[29]}]
set_drive 7.63567  [get_ports {scale_CONV2[28]}]
set_drive 7.63567  [get_ports {scale_CONV2[27]}]
set_drive 7.63567  [get_ports {scale_CONV2[26]}]
set_drive 7.63567  [get_ports {scale_CONV2[25]}]
set_drive 7.63567  [get_ports {scale_CONV2[24]}]
set_drive 7.63567  [get_ports {scale_CONV2[23]}]
set_drive 7.63567  [get_ports {scale_CONV2[22]}]
set_drive 7.63567  [get_ports {scale_CONV2[21]}]
set_drive 7.63567  [get_ports {scale_CONV2[20]}]
set_drive 7.63567  [get_ports {scale_CONV2[19]}]
set_drive 7.63567  [get_ports {scale_CONV2[18]}]
set_drive 7.63567  [get_ports {scale_CONV2[17]}]
set_drive 7.63567  [get_ports {scale_CONV2[16]}]
set_drive 7.63567  [get_ports {scale_CONV2[15]}]
set_drive 7.63567  [get_ports {scale_CONV2[14]}]
set_drive 7.63567  [get_ports {scale_CONV2[13]}]
set_drive 7.63567  [get_ports {scale_CONV2[12]}]
set_drive 7.63567  [get_ports {scale_CONV2[11]}]
set_drive 7.63567  [get_ports {scale_CONV2[10]}]
set_drive 7.63567  [get_ports {scale_CONV2[9]}]
set_drive 7.63567  [get_ports {scale_CONV2[8]}]
set_drive 7.63567  [get_ports {scale_CONV2[7]}]
set_drive 7.63567  [get_ports {scale_CONV2[6]}]
set_drive 7.63567  [get_ports {scale_CONV2[5]}]
set_drive 7.63567  [get_ports {scale_CONV2[4]}]
set_drive 7.63567  [get_ports {scale_CONV2[3]}]
set_drive 7.63567  [get_ports {scale_CONV2[2]}]
set_drive 7.63567  [get_ports {scale_CONV2[1]}]
set_drive 7.63567  [get_ports {scale_CONV2[0]}]
set_drive 7.63567  [get_ports {scale_CONV3[31]}]
set_drive 7.63567  [get_ports {scale_CONV3[30]}]
set_drive 7.63567  [get_ports {scale_CONV3[29]}]
set_drive 7.63567  [get_ports {scale_CONV3[28]}]
set_drive 7.63567  [get_ports {scale_CONV3[27]}]
set_drive 7.63567  [get_ports {scale_CONV3[26]}]
set_drive 7.63567  [get_ports {scale_CONV3[25]}]
set_drive 7.63567  [get_ports {scale_CONV3[24]}]
set_drive 7.63567  [get_ports {scale_CONV3[23]}]
set_drive 7.63567  [get_ports {scale_CONV3[22]}]
set_drive 7.63567  [get_ports {scale_CONV3[21]}]
set_drive 7.63567  [get_ports {scale_CONV3[20]}]
set_drive 7.63567  [get_ports {scale_CONV3[19]}]
set_drive 7.63567  [get_ports {scale_CONV3[18]}]
set_drive 7.63567  [get_ports {scale_CONV3[17]}]
set_drive 7.63567  [get_ports {scale_CONV3[16]}]
set_drive 7.63567  [get_ports {scale_CONV3[15]}]
set_drive 7.63567  [get_ports {scale_CONV3[14]}]
set_drive 7.63567  [get_ports {scale_CONV3[13]}]
set_drive 7.63567  [get_ports {scale_CONV3[12]}]
set_drive 7.63567  [get_ports {scale_CONV3[11]}]
set_drive 7.63567  [get_ports {scale_CONV3[10]}]
set_drive 7.63567  [get_ports {scale_CONV3[9]}]
set_drive 7.63567  [get_ports {scale_CONV3[8]}]
set_drive 7.63567  [get_ports {scale_CONV3[7]}]
set_drive 7.63567  [get_ports {scale_CONV3[6]}]
set_drive 7.63567  [get_ports {scale_CONV3[5]}]
set_drive 7.63567  [get_ports {scale_CONV3[4]}]
set_drive 7.63567  [get_ports {scale_CONV3[3]}]
set_drive 7.63567  [get_ports {scale_CONV3[2]}]
set_drive 7.63567  [get_ports {scale_CONV3[1]}]
set_drive 7.63567  [get_ports {scale_CONV3[0]}]
set_drive 7.63567  [get_ports {scale_FC1[31]}]
set_drive 7.63567  [get_ports {scale_FC1[30]}]
set_drive 7.63567  [get_ports {scale_FC1[29]}]
set_drive 7.63567  [get_ports {scale_FC1[28]}]
set_drive 7.63567  [get_ports {scale_FC1[27]}]
set_drive 7.63567  [get_ports {scale_FC1[26]}]
set_drive 7.63567  [get_ports {scale_FC1[25]}]
set_drive 7.63567  [get_ports {scale_FC1[24]}]
set_drive 7.63567  [get_ports {scale_FC1[23]}]
set_drive 7.63567  [get_ports {scale_FC1[22]}]
set_drive 7.63567  [get_ports {scale_FC1[21]}]
set_drive 7.63567  [get_ports {scale_FC1[20]}]
set_drive 7.63567  [get_ports {scale_FC1[19]}]
set_drive 7.63567  [get_ports {scale_FC1[18]}]
set_drive 7.63567  [get_ports {scale_FC1[17]}]
set_drive 7.63567  [get_ports {scale_FC1[16]}]
set_drive 7.63567  [get_ports {scale_FC1[15]}]
set_drive 7.63567  [get_ports {scale_FC1[14]}]
set_drive 7.63567  [get_ports {scale_FC1[13]}]
set_drive 7.63567  [get_ports {scale_FC1[12]}]
set_drive 7.63567  [get_ports {scale_FC1[11]}]
set_drive 7.63567  [get_ports {scale_FC1[10]}]
set_drive 7.63567  [get_ports {scale_FC1[9]}]
set_drive 7.63567  [get_ports {scale_FC1[8]}]
set_drive 7.63567  [get_ports {scale_FC1[7]}]
set_drive 7.63567  [get_ports {scale_FC1[6]}]
set_drive 7.63567  [get_ports {scale_FC1[5]}]
set_drive 7.63567  [get_ports {scale_FC1[4]}]
set_drive 7.63567  [get_ports {scale_FC1[3]}]
set_drive 7.63567  [get_ports {scale_FC1[2]}]
set_drive 7.63567  [get_ports {scale_FC1[1]}]
set_drive 7.63567  [get_ports {scale_FC1[0]}]
set_drive 7.63567  [get_ports {scale_FC2[31]}]
set_drive 7.63567  [get_ports {scale_FC2[30]}]
set_drive 7.63567  [get_ports {scale_FC2[29]}]
set_drive 7.63567  [get_ports {scale_FC2[28]}]
set_drive 7.63567  [get_ports {scale_FC2[27]}]
set_drive 7.63567  [get_ports {scale_FC2[26]}]
set_drive 7.63567  [get_ports {scale_FC2[25]}]
set_drive 7.63567  [get_ports {scale_FC2[24]}]
set_drive 7.63567  [get_ports {scale_FC2[23]}]
set_drive 7.63567  [get_ports {scale_FC2[22]}]
set_drive 7.63567  [get_ports {scale_FC2[21]}]
set_drive 7.63567  [get_ports {scale_FC2[20]}]
set_drive 7.63567  [get_ports {scale_FC2[19]}]
set_drive 7.63567  [get_ports {scale_FC2[18]}]
set_drive 7.63567  [get_ports {scale_FC2[17]}]
set_drive 7.63567  [get_ports {scale_FC2[16]}]
set_drive 7.63567  [get_ports {scale_FC2[15]}]
set_drive 7.63567  [get_ports {scale_FC2[14]}]
set_drive 7.63567  [get_ports {scale_FC2[13]}]
set_drive 7.63567  [get_ports {scale_FC2[12]}]
set_drive 7.63567  [get_ports {scale_FC2[11]}]
set_drive 7.63567  [get_ports {scale_FC2[10]}]
set_drive 7.63567  [get_ports {scale_FC2[9]}]
set_drive 7.63567  [get_ports {scale_FC2[8]}]
set_drive 7.63567  [get_ports {scale_FC2[7]}]
set_drive 7.63567  [get_ports {scale_FC2[6]}]
set_drive 7.63567  [get_ports {scale_FC2[5]}]
set_drive 7.63567  [get_ports {scale_FC2[4]}]
set_drive 7.63567  [get_ports {scale_FC2[3]}]
set_drive 7.63567  [get_ports {scale_FC2[2]}]
set_drive 7.63567  [get_ports {scale_FC2[1]}]
set_drive 7.63567  [get_ports {scale_FC2[0]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[31]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[30]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[29]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[28]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[27]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[26]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[25]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[24]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[23]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[22]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[21]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[20]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[19]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[18]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[17]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[16]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[15]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[14]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[13]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[12]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[11]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[10]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[9]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[8]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[7]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[6]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[5]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[4]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[3]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[2]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[1]}]
set_drive 7.63567  [get_ports {sram_weight_rdata0[0]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[31]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[30]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[29]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[28]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[27]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[26]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[25]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[24]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[23]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[22]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[21]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[20]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[19]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[18]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[17]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[16]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[15]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[14]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[13]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[12]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[11]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[10]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[9]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[8]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[7]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[6]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[5]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[4]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[3]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[2]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[1]}]
set_drive 7.63567  [get_ports {sram_weight_rdata1[0]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[31]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[30]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[29]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[28]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[27]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[26]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[25]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[24]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[23]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[22]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[21]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[20]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[19]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[18]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[17]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[16]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[15]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[14]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[13]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[12]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[11]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[10]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[9]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[8]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[7]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[6]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[5]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[4]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[3]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[2]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[1]}]
set_drive 7.63567  [get_ports {sram_act_rdata0[0]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[31]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[30]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[29]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[28]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[27]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[26]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[25]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[24]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[23]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[22]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[21]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[20]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[19]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[18]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[17]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[16]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[15]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[14]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[13]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[12]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[11]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[10]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[9]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[8]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[7]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[6]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[5]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[4]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[3]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[2]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[1]}]
set_drive 7.63567  [get_ports {sram_act_rdata1[0]}]
